{
  "experience": [
    {
      "id": 1,
      "title": {
        "en": "Fullstack Software Developer",
        "es": "Desarrollador de Software Fullstack"
      },
      "company": "Kiev Line, Zurich-Seitanilm",
      "period": {
        "en": "May 2024 - Present",
        "es": "Mayo 2024 - Presente"
      },
      "description": {
        "en": "Developing robust and scalable web solutions as a Fullstack Developer, focusing on high-performance backend architecture and secure API design.",
        "es": "Desarrollo de soluciones web robustas y escalables como Fullstack Developer, centrado en la arquitectura de backend de alto rendimiento y el diseño seguro de APIs."
      },
      "achievements": {
        "en": [
          "Led the migration of the main platform to a Python microservice, improving latency by 35%.",
          "Designed and implemented secure RESTful APIs to integrate critical third-party services.",
          "Implemented unit and integration tests that resulted in a 90% reduction of production failures."
        ],
        "es": [
          "Lideré la migración de la plataforma principal a un microservicio en Python, mejorando la latencia en un 35%.",
          "Diseñé e implementé APIs RESTful seguras para integrar servicios críticos de terceros.",
          "Implementé pruebas unitarias y de integración que resultaron en una reducción del 90% de fallos en producción."
        ]
      },
      "technologies": ["Python", "Django", "React", "PostgreSQL", "Scrum"],
      "isCurrent": true
    },
    {
      "id": 2,
      "title": {
        "en": "Head of IT Department",
        "es": "Jefe del Departamento de TI"
      },
      "company": "Reborn Developments",
      "period": {
        "en": "Dec 2022 - Present",
        "es": "Dic 2022 - Presente"
      },
      "description": {
        "en": "Strategic management of technological infrastructure, cybersecurity oversight, and leadership of the IT development team for the company's innovative projects.",
        "es": "Gestión estratégica de la infraestructura tecnológica, supervisión de ciberseguridad y liderazgo del equipo de desarrollo de TI para los proyectos innovadores de la empresa."
      },
      "achievements": {
        "en": [
          "Supervised the implementation of a Fortinet-based cybersecurity policy, reducing critical network vulnerabilities.",
          "Led a team of 5 developers and IT specialists, improving project efficiency by 20% through Agile practices.",
          "Designed the cloud migration plan to optimize operational costs and enhance system resilience."
        ],
        "es": [
          "Supervisé la implementación de una política de ciberseguridad basada en Fortinet, reduciendo vulnerabilidades críticas de la red.",
          "Lideré un equipo de 5 desarrolladores y especialistas en TI, mejorando la eficiencia del proyecto en un 20% con prácticas Ágiles.",
          "Diseñé el plan de migración a la nube para optimizar los costos operativos y mejorar la resiliencia del sistema."
        ]
      },
      "technologies": ["Linux", "Fortinet", "Docker", "CI/CD", "Scrum"],
      "isCurrent": true
    },
    {
      "id": 3,
      "title": {
        "en": "Fullstack Software Developer",
        "es": "Desarrollador de Software Fullstack"
      },
      "company": "Pusaq 8 Innovations",
      "period": {
        "en": "2022 - May 2024",
        "es": "2022 - Mayo 2024"
      },
      "description": {
        "en": "Developed cutting-edge cross-platform mobile applications (Flutter) and integrated them with efficient microservices built on modern backend technologies.",
        "es": "Desarrollo de aplicaciones móviles multiplataforma (Flutter) de vanguardia e integración con microservicios eficientes construidos con tecnologías backend modernas."
      },
      "achievements": {
        "en": [
          "Developed the company's main mobile application from scratch using Flutter, available on iOS and Android.",
          "Optimized API resource consumption, successfully handling a 50% increase in user traffic.",
          "Collaborated with the design team to ensure high accessibility and usability (UX) standards for the app."
        ],
        "es": [
          "Desarrollé desde cero la aplicación móvil principal de la compañía usando Flutter, disponible en iOS y Android.",
          "Optimicé el consumo de recursos en la API, manejando exitosamente un incremento del tráfico de usuarios del 50%.",
          "Colaboré con el equipo de diseño para garantizar altos estándares de accesibilidad y usabilidad (UX) de la aplicación."
        ]
      },
      "technologies": ["Flutter", "Dart", "Fast API", "Mongo Db", "UX/UI"],
      "isCurrent": false
    },
    {
      "id": 4,
      "title": {
        "en": "Software Engineer",
        "es": "Ingeniero de Software"
      },
      "company": "Nuclea Solutions",
      "period": {
        "en": "Jan 2019 - Present",
        "es": "Enero 2019 - Presente"
      },
      "description": {
        "en": "Core software engineering focused on building complex and robust solutions, specializing in performance optimization and enterprise-level scalability using Java/Spring Boot.",
        "es": "Ingeniería de software central enfocada en construir soluciones complejas y robustas, especializándome en la optimización del rendimiento y la escalabilidad a nivel empresarial usando Java/Spring Boot."
      },
      "achievements": {
        "en": [
          "Participated in the design and implementation of the highly scalable microservices architecture.",
          "Developed key backend modules using Java and Spring Boot for critical transaction processing.",
          "Performed major code refactoring efforts that improved project maintainability by over 25%."
        ],
        "es": [
          "Participé en el diseño e implementación de la arquitectura de microservicios altamente escalables.",
          "Desarrollé módulos clave de backend usando Java y Spring Boot para el procesamiento de transacciones críticas.",
          "Realicé importantes refactorizaciones de código que mejoraron la mantenibilidad del proyecto en más de un 25%."
        ]
      },
      "technologies": ["Java", "Spring Boot", "MySQL", "React", "CI/CD"],
      "isCurrent": true
    }
  ]
}