{
  "personal": {
    "name": {
      "en": "Andres Vargas",
      "es": "Andres Vargas"
    },
    "title": {
      "en": "Full-Stack Developer, Cybersecurity & UX/UI Specialist",
      "es": "Desarrollador Full-Stack, Ciberseguridad y Especialista UX/UI"
    },
    "location": {
      "en": "Cochabamba, Bolivia",
      "es": "Cochabamba, Bolivia"
    },
    "email": "andres83610@gmail.com",
    "phone": "+591 70795878",
    "timezone": "GMT-4",
    "bio": {
      "en": "I'm a seasoned Full-Stack Developer with over 5 years of experience building secure, scalable, and high-performance digital products. My expertise covers the full spectrum of development, from Python back-end architecture to cross-platform mobile apps (Flutter), complemented by strategic specialization in Network Security (Fortinet) and user-centric design (MIT). My mission is to deliver complete solutions that excel in technology, usability, and strategic growth.",
      "es": "Soy un Desarrollador Full-Stack experimentado con más de 5 años creando productos digitales seguros, escalables y de alto rendimiento. Mi experiencia abarca todo el espectro del desarrollo, desde la arquitectura de backend en Python hasta aplicaciones móviles multiplataforma (Flutter), complementado con especialización estratégica en Seguridad de Red (Fortinet) y diseño centrado en el usuario (MIT). Mi misión es entregar soluciones completas que destaquen en tecnología, usabilidad y crecimiento estratégico."
    },
    "shortBio": {
      "en": "Full-Stack Developer focused on security, performance, and strategic growth. Let's build your next digital product.",
      "es": "Desarrollador Full-Stack enfocado en seguridad, rendimiento y crecimiento estratégico. Construyamos tu próximo producto digital."
    },
    "social": {
      "github": "https://github.com/cbbeandresvargas",
      "linkedin": "https://www.linkedin.com/in/andres-vargas-martins/",
      "twitter": "https://twitter.com/andresvargas",
      "email": "andresvm10@gmail.com"
    },
    "yearsOfExperience": 5,
    "projectsCompleted": 15,
    "happyClients": 7,
    "technologiesUsed": 10
  }
}